//https://microkents.hatenablog.com/entry/2018/12/20/204658
#include <bits/stdc++.h>
#define rep(i, n) for (int i = 0; i < (n); ++i)
using namespace std;
using ll = long long;
using P = pair<int, int>;

//const int HMAX=50;
//const int WMAX=50;

int main() {
  int h, w;
  cin >> h >> w;

  string G[h];
  //for (int i = 0; i < h; i++) cin >> G[i];
	char G[h][w];

	//入力の生成
	srand(time(NULL));
	for(int y = 0; y < h; ++y) {
		for(int x = 0; x < w; ++x) {
			cin >> G[y][x];
			//if(rand()%10==0) G[x][y]='.';
			//else G[x][y]='#';
    }
  }
	cout << endl;
	rep(i,h){
		rep(j,w) {
		cout << G[i][j];}
		cout << endl;
	}

	//本処理
  const int dy[4] = {-1, 0, 0, 1};//dyとdxがあべこべになっていれば、どう割り振っていてもOK
  const int dx[4] = {0, -1, 1, 0};

  bool can = true;
  for (int i = 0; i < h; i++) {
    for (int j = 0; j < w; j++) {
      if (G[i][j] == '#') {
        bool sharp = false;
        for (int d = 0; d < 4; d++) {
          if (i + dy[d] < 0 || h <= i + dy[d]) continue;//もし配列の境界外を指定するようなことがあれば、処理を飛ばす
          if (j + dx[d] < 0 || w <= j + dx[d]) continue;
          if (G[i + dy[d]][j + dx[d]] == '#') sharp = true;
        }
        if (sharp == false) can = false;
      }
    }
  }

  if (can)
    cout << "Yes" << endl;
  else
    cout << "No" << endl;
}

/*
20 20
.###################
######.####.###.###.
####################
##.##########.###.##
####################
##########.#########
####.###############
###########..##..##.
####.##.######.###.#
#####.######.###.###
.###################
###.###.###.###.###.
##.##.####..###.###.
########.###########
#######.############
####################
####################
####################
####################
####################


20 20
. # # # # # # # # # # # # # # # # # # #
# # # # # # . # # # # . # # # . # # # .
# # # # # # # # # # # # # # # # # # # #
# # . # # # # # # # # # # . # # # . # #
# # # # # # # # # # # # # # # # # # # #
# # # # # # # # # # . # # # # # # # # #
# # # # . # # # # # # # # # # # # # # #
# # # # # # # # # # # . . # # . . # # .
# # # # . # # . # # # # # # . # # # . #
# # # # # . # # # # # # . # # # . # # #
. # # # # # # # # # # # # # # # # # # #
# # # . # # # . # # # . # # # . # # # .
# # . # # . # # # # . . # # # . # # # .
# # # # # # # # . # # # # # # # # # # #
# # # # # # # . # # # # # # # # # # # #
# # # # # # # # # # # # # # # # # # # #
# # # # # # # # # # # # # # # # # # # #
# # # # # # # # # # # # # # # # # # # #
# # # # # # # # # # # # # # # # # # # #
# # # # # # # # # # # # # # # # # # # #

*/
